Revit 2027 API
RuledSurface.GetFirstProfilePoint Method
 If a point was used to define the first profile, returns a copy of that point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetFirstProfilePoint()
Public Function GetFirstProfilePoint As XYZ
public:
XYZ^ GetFirstProfilePoint()
member GetFirstProfilePoint : unit -> XYZ
Return Value
XYZ
 The first profile point if it was set.
Exceptions
Exception | Condition
InvalidOperationException |  This surface element does not use a point to define the first profile.
See Also
Reference
RuledSurface Class
Autodesk.Revit.DB Namespace